Revit 2026 API

# RuledSurfaceGetSecondProfileCurve Method

---

Returns a copy of the second profile curve if it is set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Curve GetSecondProfileCurve()
```
```vb
Public Function GetSecondProfileCurve As Curve
```
```cpp
public:
Curve^ GetSecondProfileCurve()
```
```fsharp
member GetSecondProfileCurve : unit -> Curve
```

#### Return Value

Curve A copy of the second profile curve, if it exists. If a point was used to define the second profile, this function will return .

#### Reference

RuledSurface Class

Autodesk.Revit.DB Namespace